[
  {
    "path": "posts/2021-05-30-assignment-1/",
    "title": "Assignment 1",
    "description": "Data Visualization Makeover 1",
    "author": [
      {
        "name": "Peirong LIN",
        "url": "https://www.linkedin.com/in/perry-lin/"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\nMakeover a plot from Merchandise Trade of Singapore\r\nThis is written as the requirements for the Visual Analytics module for MITB.\r\nFor my first DataViz makeover, I have used the data from Merchandise Trade of Singapore , which analyses the Top 6 countries and regions export and import to Singapore.\r\n1. The original data visualization\r\n\r\nThe original plot has two main problems: 1. I cannot tell the Top 6 ranking from this picture. 2. I cannot see very clearly the difference and relationship between export and import for each country or region.\r\n2. Critiques and suggestions\r\n2.1 Clarity\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nCannot distinguish Top 6 sequence from the chart\r\nSequence the order from largest to smallest\r\n2\r\nThe axis for each sub chart is different.\r\nChange to same axis that can demonstrate all six charts.\r\n3\r\nThe original data has thousand dollars as unit, but the chart didn’t show that.\r\nMention the unit in the y axis.\r\n2.2 Aesthetics\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nLines with filling area is not good to see the difference between import and export.\r\nChange to normal line plot without filling the area.\r\n2\r\nSix plots don’t have the same size.\r\nChange them into same size.\r\n3\r\nThe title of x axis is not accurate.\r\nChange the title to fit with the plot.\r\n4\r\nThe original plot cannot see the difference of export and import clearly.\r\nUse color to distinguish export and import, as well as the difference.\r\n3. Proposed Design\r\n3.1 Sketch of Proposition\r\n I will put import and export for total Top 6 countries and regions, and put separately six countries and regions as the sequence of Total(import+export) ranking.\r\nMoreoever, I will compute the difference of export and import (Export-Import) as the label of tooltips in each subplots from 1 to 6.\r\n3.2. Improvment to achieve\r\nMore Information to show - I put the total overall of import and export for Top 6 countries and regions.\r\n\r\nClear plot - I use line plot to show the trend and comparison for each country or regions separately.\r\n\r\nRanking for intuitive - I use floating number to show the ranking for six countries and regions.\r\n\r\nAxises are properly labeled - I add unit for the two bigger plot, and change the name of x axis and y axis.\r\n\r\nColors are consistent throughout the whole dashboard.\r\n\r\n4. Data Visualization steps\r\nFor data preparation, I use excel, Tableau Prep and R to do the data cleaning, selection and transformation.\r\nFor data visualization, I use Tableau to finish all the steps.\r\n4.1. Data preparation\r\nFor data preparation, first I check the data in excel to ensure all the data I want is clean and clear. Then, I import all the original data to Tableau Prep to run the flow and select the data I want. After that, I import the output from Tableau Prep into R and do the data transformation. To better visualize the data, I change the Time(visualizing in Year) to row and selected countries to columns.\r\n4.1.1. convert text to number in excel\r\nFirst, I open the Outputfile to read the data in excel, and find that all the numbers are in text format, so I change it into number.\r\n\r\n4.1.2. Tableau Data Prep\r\nAfter doing 4.1.1, I import the data into Tableau Prep flow, I filter the countries and regions I want from Variables, and select the Time from 2019 to 2020 monthly basis.\r\n\r\n\r\n\r\nAfter filtering the data, I run the Output(for import) and Output2(for export) to export csv from T1 and T2.\r\n\r\nTo better do the data transform in R, I change the csv format to xlsx format manually.\r\n4.1.3. Data Transform - R\r\nread excel in to R\r\n\r\n\r\n\r\nimport <- readxl::read_xlsx(\"Imports.xlsx\",\r\n                            sheet = \"Imports\",range = \"A1:Y7\",col_names = TRUE)\r\nexport <- readxl::read_xlsx(\"Exports.xlsx\",\r\n                            sheet = \"Exports\",range = \"A1:Y7\",col_names = TRUE)\r\n\r\n\r\n\r\neliminate Long words\r\n\r\nFor better visualization, I delete the unit followed by countries, and change to Import and Export to better distinguish in the plot.\r\n\r\n\r\nfor (i in 1:6){\r\n  import[i,1] <- gsub(\"(Thousand Dollars)\",\"Import\",import[i,1])\r\n  export[i,1] <- gsub(\"(Thousand Dollars)\",\"Export\",export[i,1])\r\n}\r\n\r\n\r\n\r\nswtich rows and columns\r\n\r\n\r\n\r\nimport_df <- \r\n  import %>%\r\n  pivot_longer(-Variables,names_to = 'Time', values_to = 'imports') %>%\r\n  pivot_wider(names_from = Variables, values_from  = imports) \r\n\r\n\r\n\r\n\r\n\r\nexport_df <- \r\n  export %>%\r\n  pivot_longer(-Variables,names_to = 'Time', values_to = 'exports') %>%\r\n  pivot_wider(names_from = Variables, values_from  = exports)\r\n\r\n\r\n\r\nwrite the new data frame into csv\r\n\r\n\r\n\r\nwrite.csv(import_df,file = '~/smu/Term3/Visual Analytics-ISSS608/DataViz Makeover 1/import.csv')\r\nwrite.csv(export_df,file = '~/smu/Term3/Visual Analytics-ISSS608/DataViz Makeover 1/export.csv')\r\n\r\n\r\n\r\n4.2 Data Visualization\r\nImport clean data into Tableau.\r\n\r\nCreate 6 sheets for 6 countries and regions. (The figure shown is the example of Mainland China).\r\n\r\nChange the axis starts, ends and intervals for each plot.\r\n\r\n\r\n\r\nCreate calculation field\r\nFirst, I crate the balance of trade, use the formula of Export - Import.\r\n\r\nThen, I create Favorable Trade and Unfavorable Trade, so I can separate them and use different colors for better visualization.\r\n\r\nSimilar with Favorable Trade calculation field, if balance of trade <= 0, we return balance of trade as Unfavorable Trade.\r\n\r\nAfter doing these steps to Mainland China, we do the same steps to other 5 countries and regions.\r\n5. Final Visualization\r\n\r\nData Source:Merchandise Trade of Singapore\r\nFull visualization available at Peirong Lin - Tableau Public\r\n6. Main Observations\r\nHong Kong has the maximum balance of trade among the six countries and regions, while Japan has the minumum.\r\nTo some degree, the export of Mainland China and Malaysia is related to import of theirs, and usually a month former.\r\nTo some degree, the export of United States and Taiwan is a little bit opposite to the import of theirs.\r\nBoth Mainland China and Malaysia have a big drop down in the beginning of 2020, which may be the lock down impact, (The lock down in China is Feb 2020 and Singapore in Apr 2020) while United States raises in Feb 2020 and drop quickly in Sep 2020.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T15:06:09+08:00",
    "input_file": "assignment-1.knit.md"
  },
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Peirong LIN",
        "url": "https://www.linkedin.com/in/perry-lin/"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nIn this article, we will show you how to plot a figure with multiple histograms by using ggplot2 and ggpubr packages.\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nFigure below shows the scatter plot of Tableau.\r\n\r\nHere is the screenshot of edit calculation field.\r\n\r\nNext, you will use the code chunk below to install and launch ggpubr and tidyverse in RStudio.\r\nR code\r\npackages = c(‘ggpubr’, ‘tidyverse’)\r\nfor(p in packages){library if(!require(p, character.only = T)){ install.packages(p) } library(p, character.only = T) }\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\nR code\r\nwine <- read_csv(“data/wine_quality.csv”)\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted by using ggplot() and geom_histogram() of ggplot2 package. Then, ggarrange() of ggpubr package is used to patch these histogram into a single figure to reveal the distribution of the selected variables in the wine quality data sets.\r\nRcode\r\nfa <- ggplot(data=wine, aes(x= fixed acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) va <- ggplot(data=wine, aes(x= volatile acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ca <- ggplot(data=wine, aes(x= citric acid)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) rs <- ggplot(data=wine, aes(x= residual sugar)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ch <- ggplot(data=wine, aes(x= chlorides)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) fSO2 <- ggplot(data=wine, aes(x= free sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) tSO2 <- ggplot(data=wine, aes(x= total sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) density <- ggplot(data=wine, aes(x= density)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) pH <- ggplot(data=wine, aes(x= pH)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) sulphates <- ggplot(data=wine, aes(x= sulphates)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) alcohol <- ggplot(data=wine, aes(x= alcohol)) + geom_histogram(bins=20, color=“black”, fill=“light blue”)\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-22T17:26:29+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  }
]
